const NOTUS_ISSOE = [
  {"insert": "السلام عليكم"},
  {
    "insert": "\n",
    "attributes": {"heading": 2}
  },
  {
    "insert": {"_type": "hr", "_inline": false}
  },
  {"insert": "\n\n"}
];

const NOTUS_SIMPLE = [
  {"insert": "مرحباً بك في المحرر الجديد"},
  {
    "insert": "\n",
    "attributes": {"heading": 2}
  },
  {
    "insert": {"_type": "hr", "_inline": false}
  },
  {"insert": "\n"},
  {
    "insert": {"_type": "image", "_inline": false, "source": "asset://assets/images/breeze.jpg"}
  },
  {"insert": "\n"},
  {
    "insert": {"_type": "video", "_inline": false, "source": "https://www.youtube.com/embed/fxQJ6J517pM"}
  },
  {
    "insert":
        "\nومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.\nإذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.\nهذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق."
  },
  {
    "insert": "\n",
    "attributes": {"block": "quote"}
  },
  {
    "insert":
        "إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.\nالعنصر الأول"
  },
  {
    "insert": "\n",
    "attributes": {"block": "ol"}
  },
  {"insert": "العنصر الثاني"},
  {
    "insert": "\n",
    "attributes": {"block": "ol"}
  },
  {"insert": "شكراً لك!"},
  {
    "insert": "\n",
    "attributes": {"heading": 3}
  },
  {"insert": "العنصر القائم الأول"},
  {
    "insert": "\n",
    "attributes": {"block": "ul"}
  },
  {"insert": "العنصر القائم الثاني"},
  {
    "insert": "\n",
    "attributes": {"block": "ul"}
  },
  {
    "insert":
        "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.\n"
  },
  {
    "insert": {"_type": "tweet", "_inline": false, "source": "1162004768367058944"}
  },
  {"insert": "\n"}
];

const QUILL_TO_ZEFYR_SIMPLE =
    '{\"ops\":[{\"insert\":\"قالتها يائسةً:  انا انتهيت !!! \\n\\\"لم يعد لي مكان هنا ، وقد وجب الرحيل \\\".\\n لم تكن كلماتها يوماً اكثر ثباتا من هذ المرة. بريق عينيها المنطفيء، كان دليلاً  كافياً ان امراً مريباً على وشك الحدوث.  تنبهت لذلك فور سقوط دمعة رقراقة من عينيها فما كان مني سوى ان أمسك بكلتا يديها بدفء محتضنة عينيها بكامل تركيزي لأقول  :\\nلااااا ، أؤكد لك انك لم تنتهي بعد يا صديقتي. \\nمازالت لقصتك بقية. و لست انت من ينهيها ، لست انت من يسدل الستار قبل اخر مشهد فيها، واهمة انت ان اعتقدت انه هكذا تختم القصص . عزيزتي عليك المحاولة مرة اخرى.\\n- عمياء انت الا تربن ان جميع محاولاتي نفذت. كل طاقاتي استنزفت. خساراتي المتتابعة لاتسمح لي باذلال كبريائي اكثر، وهاهو الخذلان الذي لازم رحلتي حتى من اقربهم يطعنني في كل خاطرة ذكرى او التفاتة حنين.\\n- لا لم تنفذ بدليل انك مازلت تعيشين الشتات ولم تجدين نفسك بعد وهذا يدعوك لمتابعة المسير حتى تجدينها  إياك ان تعتقدي اننا نعاكسك في ذلك فجميعنا في رحلة بحث ايضا  عن مكانه في هذا العالم . ولايغرنك من يعتقد ان مسقط رأسه هو الملاذ بل هو المنفى فلو كان الحال كذلك  فلماذا كل هذا البؤس على وجه امي وهي لم تغادر قريتها يوماً. كوني على يقين انك ستجدين ذاتك يوما وطول الرحلة ماهو الى مرحلة تجمعين فيها زوّادتك لذلك اليوم فلاتسمحي لليأس ان يتسلل الى نفسك ولاتمكني سخرية الاخرين من احلامك ولا لانتفاضتهم في كل مرة تحرزين تقدماً ان تثني عزيمتك. كما كانت بصيرتك قوية في الصبا وخطاك واضحة استمري و تناسي كل تلك التعقيدات التي حصلت حينها اطردي الخوف والقلق والشك من ذهنك، المهم ان تواصلي المسير، المواصلة هي الضمان الوحيد للنجاة في النهاية. هي البركة التي ستصاحب خطواتك صدقيني. فالاستسلام لعنة تصاحبها كل الخطايا لن أوهمك ان الحياة جميلة انا أؤكد لك انها جميلة بالفعل لاتحتاج منك سوى تأجيج شرارة الأمل باستمرار عاجلي حزنك بابتسامه باغتيه بفرح واكسري انهيارك برقصة.\\nلاتطبعي قصتك بحبر باهت و كئيب للعالم. اجعليه داكنا لماعًا . جميعنا مُلزَم ان يحكي حكايا نجاحه للناس فنحن رُسُل لبعضنا ولا قيمة بدون المجد. \\nحتى وان اندكت من حولك جميع أعمدة الأحلام فلتكوني  حجر الزاوية في صنع أخرى اكثر احكاماً. واجعلي من قصتك منفذا لأولئك الذين يبحثون عن ملاذا يحتويهم بعيداً عن قصصهم ويهروبون اليه من حكاياهم. بادري و اشعلي فتيلهم مرة اخرى .\\nسواء بقصة ، أو بأمل ، أو برجاء ، أو بعبور.\\n فان لم نكن مدينين لذواتنا ، فإننا حتماً مدينون للحياة. \\n\"}]}';

const QUILL_TO_ZEFYR_COMPLEX_JSON = {
  "ops": [
    {
      "insert":
          "السلام عليكم ورحمة الله وبركاته،\nبعد طرح نسخة 1.1.0 عملنا بجهد على تحسين تجربة استخدام تطبيق كلمة على نظامي iOS و Android لضمان تجربة استخدام مستقرة وآمنة. قمنا خلال هذه الفترة بتحسينات مهمة لتجربة استخدام الأجهزة اللوحية والأجهزة ذات الإصدارات القديمة.\nكما قمنا بإضافة عدد من المميزات الجديدة، وإليك أهمها:\n"
    },
    {
      "insert": {"divider": true}
    },
    {"insert": "العناصر المدمجة"},
    {
      "attributes": {"h2": true},
      "insert": "\n"
    },
    {
      "insert": {
        "image": {
          "nid": "JUp5QKwpW#up",
          "user": "dYsxj0xN8hMubzQP0gDFwJ3BYUC3",
          "dims": "{\"width\":2000.0,\"height\":2000.0,\"aspectRatio\":1.0}"
        }
      }
    },
    {
      "insert":
          "في هذه النسخة  قمنا بإضافة خاصية العناصر المدمجة والتي سبق إطلاقها على تطبيق كلمة للويب لتسهيل مشاركة المحتوى الخارجي في قصتك. تم دعم العناصر التالية:\n"
    },
    {
      "insert": {"divider": true}
    },
    {"insert": "إضافة فيديو من YouTube"},
    {
      "attributes": {"h2": true},
      "insert": "\n"
    },
    {
      "insert": {
        "image": {
          "nid": "6RNasdsad#up",
          "user": "dYsxj0xN8hMubzQP0gDFwJ3BYUC3",
          "dims": "{\"width\":2000.0,\"height\":2000.0,\"aspectRatio\":1.0}"
        }
      }
    },
    {
      "insert":
          "الآن يمكنك تعزيز محتوى قصتك بإضافة فيديو مدمج من YouTube بين سطور قصتك. وذلك من خلال نسخ رابط الفيديو من YouTube والضغط على أيقونة العناصر المدمجة وتحديد شعار YouTube ولصق الرابط في حقل النافذة المنبثقة.\n"
    },
    {
      "insert": {"divider": true}
    },
    {"insert": "مشاركة تغريدة من Twitter"},
    {
      "attributes": {"h2": true},
      "insert": "\n"
    },
    {
      "insert": {
        "image": {
          "nid": "Or7A9Hby0#up",
          "user": "dYsxj0xN8hMubzQP0gDFwJ3BYUC3",
          "dims": "{\"width\":2000.0,\"height\":2000.0,\"aspectRatio\":1.0}"
        }
      }
    },
    {
      "insert":
          "الآن يمكنك مشاركة تغريدة من منصة Twitter  ليتم عرضها والوصول إليها بسهولة بين سطور قصتك. وذلك من خلال نسخ رابط التغريدة من تطبيق Twitter والضغط على أيقونة العناصر المدمجة وتحديد شعار Twitter ولصق الرباط في حقل النافذة المنبثقة.\n"
    },
    {
      "insert": {"tweet": "1270487069161164800"}
    },
    {
      "insert": {"divider": true}
    },
    {"insert": "تحديثات أخرى"},
    {
      "attributes": {"h2": true},
      "insert": "\n"
    },
    {
      "insert":
          "كلمة بنسخة 1.1.1 تتزامن بمميزاتها مع أحدث نسخة من تطبيق كلمة للويب، وبذلك تكون جميع المميزات التي سبق إطلاقها على الويب متواجدة على تطبيق كلمة لـ iOS و Android."
    },
    {
      "attributes": {"list": "bullet"},
      "insert": "\n"
    },
    {"insert": "قمنا بتحسين تجربة محرر كلمة لسهولة أكثر ووصول أسرع لخيارات التنسيق والعناصر المدمجة."},
    {
      "attributes": {"list": "bullet"},
      "insert": "\n"
    },
    {"insert": "قمنا بتحسين تجربة استخدام متصفح كلمة الداخلي لاستعراض صفحات الويب."},
    {
      "attributes": {"list": "bullet"},
      "insert": "\n"
    },
    {
      "insert":
          "قمنا بتحسين خصائص طلب الدعم وذلك من خلال \"نسخ بيانات الدعم\" والتي تسمح لفريقنا بمعرفة المزيد عن المشكلة التي تواجه المستخدم."
    },
    {
      "attributes": {"list": "bullet"},
      "insert": "\n"
    },
    {"insert": "قمنا بإضافة واجهة ترحيبية جديدة لأعضاء كلمة الجدد!"},
    {
      "attributes": {"list": "bullet"},
      "insert": "\n"
    },
    {"insert": "قمنا بإضافة عدد الردود في قوائم القصص المختلفة لتمييز القصص ذات الردود من غيرها."},
    {
      "attributes": {"list": "bullet"},
      "insert": "\n"
    },
    {"insert": "قمنا بتحسينات طفيفة على الردود ليتم تمييزها بشكل أوضح."},
    {
      "attributes": {"list": "bullet"},
      "insert": "\n"
    },
    {"insert": "قمنا بتحسين تجربة استخدام محرك بحث كلمة ليسهل الوصول للنتيجة المطلوبة."},
    {
      "attributes": {"list": "bullet"},
      "insert": "\n"
    },
    {
      "insert":
          "الآن يمكنك الضغط على تاريخ نشر القصة وتاريخ آخر إضافة للقصة لعرض التاريخ الدقيق. كما يمكنك الضغط على وقت القراءة لعرض عدد الكلمات."
    },
    {
      "attributes": {"list": "bullet"},
      "insert": "\n"
    },
    {"insert": "كما قمنا بحل عشرات المشاكل التي تم الإبلاغ عنها من قبل الأعضاء ولهم جزيل الشكر 🌹.\n"},
    {
      "insert": {"divider": true}
    },
    {"insert": "عندك خاصيّة ترى أنها مناسبة لكلمة؟ شاركها مع فريقنا على help@kilma.app أو بالرد على هذه القصة!"},
    {
      "attributes": {"blockquote": true},
      "insert": "\n"
    },
    {"insert": "مع التحية، فريق كلمة.\n"},
  ]
};

const QUILL_TO_ZEFYR_COMPLEX_JSON_2 = {
  "ops": [
    {"insert": "فاطمة بنت الشيخ المؤذن إبراهيم السيد البلتاجي وتعرف أيضاً بعدة ألقاب أبرزها "},
    {
      "insert": "أم كلثوم",
      "attributes": {"bold": true}
    },
    {
      "insert":
          " ومنها: ثومة، الجامعة العربية، الست، سيدة الغناء العربي، شمس الأصيل، صاحبة العصمة، كوكب الشرق، قيثارة الشرق، فنانة الشعب. هي مغنية وممثلة مصرية، ولدت في محافظة الدقهلية بالخديوية المصرية في 31 ديسمبر 1898م أو رسميًا حسب السجلات المدنية في 4 مايو 1908م، وتوفيت في القاهرة بعد معاناة مع المرض في 3 فبراير 1975م. وتعد أم كلثوم من أبرز مغني القرن العشرين الميلادي، وبدأت مشوارها الفني في سن الطفولة، اشتهرت في مصر وفي عموم الوطن العربي.\n"
    },
    {
      "insert": {"divider": true}
    },
    {"insert": "البدايات"},
    {
      "insert": "\n",
      "attributes": {"h2": true}
    },
    {
      "insert":
          "عادت إلى القاهرة لكي تستقر نهائياً في عام 1921م. وكانت تغني في مسرح البوسفور في ميدان رمسيس بدون فرقة موسيقية. وغنت على مسرح حديقة الأزيكية واشتهرت بقصيدة وحقك أنت المنى والطلب وتعد هذه أول إسطوانة لها صدرت في منتصف العشرينيات وبيع منها ثمانية عشر ألف إسطوانة. وتعلمت أم كلثوم لاحقاً من أمين المهدي أصول الموسيقى، وكذلك تعلمت عزف العود على يدي أمين المهدي ومحمود رحمي ومحمد القصبحي.\n"
    },
    {
      "insert": {
        "image": {
          "nid": "@vvk6wg5#up",
          "user": "9ukEt3oZUGUdzHz2JhElKKkGuw42",
          "dims": "{\"width\":780.0,\"height\":517.0,\"aspectRatio\":1.5087040618955512}"
        }
      }
    },
    {
      "insert":
          "في عام 1923م غنت في حفلات كبار القوم، كما غنت في حفل حضرته كبار مطربات عصرها وعلى رأسهم منيرة المهدية شخصياً والتي كانت تلقب بسلطانة الطرب، والتقت في نفس العام بالموسيقار محمد عبدالوهاب لأول مرة بحفلة أقيمت في منزل والد أبي بكر خيرت.\nفي عام 1924م تعرفت إلى أحمد رامي عن طريق أبو العلا، في إحدى الحفلات التي أدت أم كلثوم فيها أغنية الصب تفضحه عيونه كان أحمد رامي حاضراً بعد أن عاد من أوروبا، فأدرك أنه قد وجد هدفه. غير أن البداية الحقيقية كانت عندما سمعها محمد القصبجي الملحن المجدد وقتها. في نفس العام 1924م، تعرفت أم كلثوم إلى طبيب أسنان يهوى الموسيقى هو أحمد صبري النجريدي أول ملحن يلحن لأم كلثوم ألحانا خاصة بها، إلا أن ألحانه اعتمدت على الزخارف الموسيقية بشكل مبالغ به مما دفع أم كلثوم إلى إنهاء التعاون معه مبكراً.\nأول فرقة موسيقية"
    },
    {
      "insert": "\n",
      "attributes": {"h3": true}
    },
    {
      "insert":
          "بدأ محمد القصبجي في إعداد أم كلثوم فنيا ومعنويا مشكلًا لها فرقتها الخاصة، وأول تخت موسيقي يكون بديلا لبطانة المعممين التي كانت معها دائما، عندما شنت روز اليوسف والمسرح هجوما صاعقا على بطانتها. لعل هذا ما جعل أباها يتخلى عن دوره كمنشد وينسحب هو والشيخ خالد. بعد ذلك بعام تقريبا خلعت أم كلثوم العقال والعباءة وظهرت في زي الآنسات المصريات، وذلك بعد أن توفى الشيخ (أبو العلا محمد) الذي ترك فيها تأثيرا روحيا عظيما وكان مرشدها في عالم الطرب.\nكان شائعًا في أوائل القرن العشرين أن يقدم المطربون قصائد بعينها بصرف النظر عن تفرد أحدهم بها، وكانت المباراة بين المطربين تكمن في كيفية أداء نفس القصيدة. وهكذا أدت أم كلثوم قصيدة (أراك عصي الدمع) مرة من ألحان السنباطي، ومرة أخرى من ألحان عبده الحامولي عام 1926.\n"
    },
    {
      "insert": {"divider": true}
    },
    {
      "insert": {"video": "https://www.youtube.com/embed/1wBvuZVE7FI?showinfo=0"}
    },
    {"insert": "من الأغاني التي غنتها أم كلثوم:"},
    {
      "insert": "\n",
      "attributes": {"h3": true}
    },
    {"insert": "طوف وشوف"},
    {
      "insert": "\n",
      "attributes": {"list": "bullet"}
    },
    {"insert": "شمس الأصيل"},
    {
      "insert": "\n",
      "attributes": {"list": "bullet"}
    },
    {"insert": "حق بلادك"},
    {
      "insert": "\n",
      "attributes": {"list": "bullet"}
    },
    {"insert": "نصره قويه وفرحه هنيه"},
    {
      "insert": "\n",
      "attributes": {"list": "bullet"}
    },
    {"insert": "صوت بلدنا"},
    {
      "insert": "\n",
      "attributes": {"list": "bullet"}
    },
    {"insert": "مصر التي في خاطري وفي دمي (صوت الوطن)"},
    {
      "insert": "\n",
      "attributes": {"list": "bullet"}
    },
    {"insert": "ياسلام على عيدنا"},
    {
      "insert": "\n",
      "attributes": {"list": "bullet"}
    },
    {"insert": "نشيد الجلاء ( يا مصر إن الحق جاء)"},
    {
      "insert": "\n",
      "attributes": {"list": "bullet"}
    },
    {"insert": "بأبي وروحي"},
    {
      "insert": "\n",
      "attributes": {"list": "bullet"}
    },
    {"insert": "بزوغ نجمها"},
    {
      "insert": "\n",
      "attributes": {"h2": true}
    },
    {
      "insert":
          "في عام 1928 تغني مونولوج (إن كنت أسامح وأنسى الآسية)، لتحقق الأسطوانة أعلى مبيعات وقتها على الإطلاق ويدوي اسم أم كلثوم بقوة في الساحة الغنائية، وهو نفس العام الذي لحنت فيه أم كلثوم أغنية (على عيني الهجر) بنفسها لنفسها!..\nوفي 31 مايو 1934م بعد افتتاح الإذاعة المصرية كانت أم كلثوم أول من غنى فيها.\nهذه القصة معاينة لمحرر \"كلمة\". المصدر: "
    },
    {
      "insert": "Wikipedia",
      "attributes": {
        "link":
            "https://ar.wikipedia.org/wiki/%D8%A3%D9%85_%D9%83%D9%84%D8%AB%D9%88%D9%85_(%D9%85%D8%B7%D8%B1%D8%A8%D8%A9)"
      }
    },
    {
      "insert": "\n",
      "attributes": {"blockquote": true}
    }
  ]
};

const QUILL_TO_ZEFYR_COMPLEX_JSON_3 = {
  "ops": [
    {
      "insert":
          "السلام عليكم ورحمة الله وبركاته،\nبعد طرح نسخة 1.0.8 عملنا بجهد على تحسين تجربة استخدام تطبيق كلمة على نظامي iOS و Android لضمان تجربة استخدام مستقرة وآمنة. قمنا خلال هذه الفترة بتحسين آداء التطبيق خصوصاً للأجهزة ذات الاصدارات القديمة.\nكما بدأنا بالعمل على الخطوات الأساسية لدعم منصات إضافية وأهمها macOS و Windows في خطوة توسع للمنصات المدعومة من قبل تطبيقات كلمة لتتمكن من الاستمتاع بكتابة قصصك من خلال الويب وكل من أنظمة iOS - Android - macOS - Windows.\nوفي هذه النسخة بالتحديد قمنا بإضافة عدد من المميزات الجديدة  وإليكم أهمها:\n"
    },
    {
      "insert": {"divider": true}
    },
    {"insert": "دعم iPad و الأجهزة اللوحية"},
    {
      "insert": "\n",
      "attributes": {"h2": true}
    },
    {
      "insert": {
        "image": {
          "nid": "a7yFQYViv#up",
          "user": "dYsxj0xN8hMubzQP0gDFwJ3BYUC3",
          "dims": "{\"width\":2000.0,\"height\":2000.0,\"aspectRatio\":1.0}"
        }
      }
    },
    {
      "insert":
          "الآن يمكنك الاستمتاع بكتابة قصصك وقراءة قصص كتابك المفضلين من خلال أجهزة iPad وأجهزة Android اللوحية من خلال تجربة استخدام مصممة خصيصاً للشاشة الكبيرة والتي تسمح لك بوصول أسرع لقصصك وكتابة أكثر راحة.\n"
    },
    {
      "insert": {"divider": true}
    },
    {"insert": "الثيم الداكن"},
    {
      "insert": "\n",
      "attributes": {"h2": true}
    },
    {
      "insert": {
        "image": {
          "nid": "4MiyMyfAR#up",
          "user": "dYsxj0xN8hMubzQP0gDFwJ3BYUC3",
          "dims": "{\"width\":1069.0,\"height\":1069.0,\"aspectRatio\":1.0}"
        }
      }
    },
    {
      "insert":
          "في هذا التحديث قمنا بطرح خاصية أخرى لضمان تجربة استخدام أروع وقراءة أكثر راحة على كلمة، فيمكنك تغيير نمط الألوان للون "
    },
    {
      "insert": "الداكن",
      "attributes": {"bold": true}
    },
    {
      "insert":
          " للاستمتاع بالقراءة بعيداً عن تشتيت الإضاءة العالية والألوان الساطعة.\nلتغيير نمط الألوان كل ماعليك فعله التوجه إلى صفحة الإعدادات وتحديد خيارات المظهر واختيار النمط المناسب لك. كما يمكنك تحديد الخيار التلقائي ليتم تحديد نمط الألوان بناءً على إعدادات الهاتف.\n"
    },
    {
      "insert": {"divider": true}
    },
    {"insert": "تحديثات أخرى"},
    {
      "insert": "\n",
      "attributes": {"h2": true}
    },
    {"insert": "تم إصلاح مشكلة تحديد النص للنسخ واللصق والتي كانت تظهر في محرر القصص."},
    {
      "insert": "\n",
      "attributes": {"list": "bullet"}
    },
    {"insert": "تم إصلاح مشكلة عدم ظهور الردود من أول زيارة."},
    {
      "insert": "\n",
      "attributes": {"list": "bullet"}
    },
    {"insert": "تم إضافة خاصية لتغيير حجم النصوص لضمان تجربة قراءة أفضل."},
    {
      "insert": "\n",
      "attributes": {"list": "bullet"}
    },
    {"insert": " تم تغيير آلية اقتصاص الصور وتقديم واجهة أبسط للاستخدام."},
    {
      "insert": "\n",
      "attributes": {"list": "bullet"}
    },
    {"insert": "كما قمنا  بحل عشرات المشاكل التي تم الإبلاغ عنها من قبل الأعضاء ولهم جزيل الشكر 🌹.\n"},
    {
      "insert": {"divider": true}
    },
    {"insert": "عندك خاصيّة ترى أنها مناسبة لكلمة؟ شاركها مع فريقنا على help@kilma.app أو بالرد على هذه القصة!"},
    {
      "insert": "\n",
      "attributes": {"blockquote": true}
    },
    {"insert": "مع التحية، فريق كلمة."},
  ]
};

const QUILL_TO_ZEFYR_COMPLEX_JSON_4 = {
  "ops": [
    {
      "insert":
          "السلام عليكم ورحمة الله وبركاته،\nبعد طرح نسخة 1.0.8 عملنا بجهد على تحسين تجربة استخدام تطبيق كلمة على نظامي iOS و Android لضمان تجربة استخدام مستقرة وآمنة. قمنا خلال هذه الفترة بتحسين آداء التطبيق خصوصاً للأجهزة ذات الاصدارات القديمة.\nكما بدأنا بالعمل على الخطوات الأساسية لدعم منصات إضافية وأهمها macOS و Windows في خطوة توسع للمنصات المدعومة من قبل تطبيقات كلمة لتتمكن من الاستمتاع بكتابة قصصك من خلال الويب وكل من أنظمة iOS - Android - macOS - Windows.\nوفي هذه النسخة بالتحديد قمنا بإضافة عدد من المميزات الجديدة  وإليكم أهمها:\n"
    },
    {
      "insert": {"divider": true}
    },
    {"insert": "دعم iPad و الأجهزة اللوحية"},
    {
      "attributes": {"h2": true},
      "insert": "\n"
    },
    {
      "insert": {
        "image":
            "https://firebasestorage.googleapis.com/v0/b/kilmaapp.appspot.com/o/users%2F9ukEt3oZUGUdzHz2JhElKKkGuw42%2Fimages%2FoJ%40VaWlNu%23un(qbvAboqHkBg)%401000.jpeg?alt=media"
      }
    },
    {
      "insert":
          "\nالآن يمكنك الاستمتاع بكتابة قصصك وقراءة قصص كتابك المفضلين من خلال أجهزة iPad وأجهزة Android اللوحية من خلال تجربة استخدام مصممة خصيصاً للشاشة الكبيرة والتي تسمح لك بوصول أسرع لقصصك وكتابة أكثر راحة.\n"
    },
    {
      "insert": {"divider": true}
    },
    {"insert": "الثيم الداكن"},
    {
      "attributes": {"h2": true},
      "insert": "\n"
    },
    {
      "insert": {
        "image":
            "https://firebasestorage.googleapis.com/v0/b/kilmaapp.appspot.com/o/users%2F9ukEt3oZUGUdzHz2JhElKKkGuw42%2Fimages%2FoJ%40VaWlNu%23un(qbvAboqHkBg)%401000.jpeg?alt=media"
      }
    },
    {
      "insert":
          "\nفي هذا التحديث قمنا بطرح خاصية أخرى لضمان تجربة استخدام أروع وقراءة أكثر راحة على كلمة، فيمكنك تغيير نمط الألوان للون "
    },
    {
      "attributes": {"bold": true},
      "insert": "الداكن"
    },
    {
      "insert":
          " للاستمتاع بالقراءة بعيداً عن تشتيت الإضاءة العالية والألوان الساطعة.\nلتغيير نمط الألوان كل ماعليك فعله التوجه إلى صفحة الإعدادات وتحديد خيارات المظهر واختيار النمط المناسب لك. كما يمكنك تحديد الخيار التلقائي ليتم تحديد نمط الألوان بناءً على إعدادات الهاتف.\n"
    },
    {
      "insert": {"divider": true}
    },
    {"insert": "تحديثات أخرى"},
    {
      "attributes": {"h2": true},
      "insert": "\n"
    },
    {"insert": "تم إصلاح مشكلة تحديد النص للنسخ واللصق والتي كانت تظهر في محرر القصص."},
    {
      "attributes": {"list": "bullet"},
      "insert": "\n"
    },
    {"insert": "تم إصلاح مشكلة عدم ظهور الردود من أول زيارة."},
    {
      "attributes": {"list": "bullet"},
      "insert": "\n"
    },
    {"insert": "تم إضافة خاصية لتغيير حجم النصوص لضمان تجربة قراءة أفضل."},
    {
      "attributes": {"list": "bullet"},
      "insert": "\n"
    },
    {"insert": " تم تغيير آلية اقتصاص الصور وتقديم واجهة أبسط للاستخدام."},
    {
      "attributes": {"list": "bullet"},
      "insert": "\n"
    },
    {"insert": "كما قمنا  بحل عشرات المشاكل التي تم الإبلاغ عنها من قبل الأعضاء ولهم جزيل الشكر 🌹.\n"},
    {
      "insert": {"divider": true}
    },
    {"insert": "عندك خاصيّة ترى أنها مناسبة لكلمة؟ شاركها مع فريقنا على help@kilma.app أو بالرد على هذه القصة!"},
    {
      "attributes": {"blockquote": true},
      "insert": "\n"
    },
    {"insert": "مع التحية، فريق كلمة.\n"}
  ]
};

const QUILL_TO_ZEFYR_NOISSUE_JSON = {
  "ops": [
    {"insert": "السلام عليكم"},
    {
      "attributes": {"h2": true},
      "insert": "\n"
    },
    {
      "insert": {"tweet": "1282747519626350592"}
    },
    {'insert': '\n'},
    {"insert": "مرحباً"},
    {
      "insert":
          "\nومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.\nإذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.\nهذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.\n"
    },
    {
      "insert": {
        "image": {
          "nid": "7odmPcLNK#up",
          "user": "245EeTQxpLWi3rFi9W7KEKdsDUV2",
          "dims": "{\"width\":1068.0,\"height\":816.0,\"aspectRatio\":1.3088235294117647}"
        }
      }
    },
    {'insert': '\n'},
    {
      "insert": {"video": "https://www.youtube.com/embed/bczyP-kDwSA"}
    },
    {"insert": "\nرائع جدا!\n"},
    {
      "insert": {"divider": true}
    },
    {'insert': '\n'},
    {
      "insert": {"tweet": "1282747893447823361"}
    },
    {'insert': '\n\n'}
  ]
};

const QUILL_TO_ZEFYR_EMPTY = {
  "ops": [
    {"insert": "السلام عليكم!\n"},
    {
      "insert": {"divider": true}
    },
    {"insert": "مرحباً بكم.\nأهلاً.\n"},
    {
      "insert": {"divider": true}
    },
    {
      "insert": {"divider": true}
    },
    {"insert": "شكراً\n"}
  ]
};
